---
kind: property
id: P:Autodesk.Revit.DB.CitySet.IsEmpty
source: html/c7225fe7-853c-008f-710e-fe2090ba86b6.htm
---
# Autodesk.Revit.DB.CitySet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.